app/serializers/residential_serializer.rb

SELECT COUNT(*) FROM "lands" WHERE "lands"."residential_id" = ?  [["residential_id", 1]]
---
  def lands_count
    object.lands.count

SELECT 1 AS one FROM "expenses" WHERE "expenses"."residential_id" = ? LIMIT ?  [["residential_id", 1], ["LIMIT", 1]]
---
  def total_expenses
    return 0 if object.expenses.empty?