app/controllers/application_controller.rb

  def decoded_token
    header = request.headers['Authorization']
    return nil if header.nil?

    token = header.split(' ').last if header
    begin
      decoded = JWT.decode(token, Rails.application.credentials.secret_key_base, true)[0]
      return nil if JwtDenylist.exists?(jti: decoded['jti'])
---
SELECT 1 AS one FROM "jwt_denylist" WHERE "jwt_denylist"."jti" = ? LIMIT ?  [["jti", "163616f1-ee02-41b6-bb00-9780e56c9598"], ["LIMIT", 1]]

  def current_user
    return nil unless decoded_token

    user_id = decoded_token['user_id']
    @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]