app/controllers/auth_controller.rb

  def login
    @user = User.find_by(email: login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rocks@example.com"], ["LIMIT", 1]]

  def logout
    jwt_token = decoded_token
    Rails.logger.debug { "jwt_token: #{jwt_token}" }
    JwtDenylist.create(jti: jwt_token["jti"], exp: Time.zone.at(jwt_token["exp"]))
---
INSERT INTO "jwt_denylist" ("jti", "exp", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["jti", "0aeb433fc5e277945321649f58f5f136"], ["exp", "2024-03-12 21:51:50"], ["created_at", "2024-03-11 23:09:11.251177"], ["updated_at", "2024-03-11 23:09:11.251177"]]