app/controllers/clients_controller.rb

INSERT INTO "clients" ("code", "full_name", "identification_card", "rfc", "address", "colony", "zip_code", "phone_number", "city", "state", "country", "assignee", "email", "birthday", "nationality", "civil_status", "spouse", "economic_dependants", "home_owner", "occupation", "company", "company_address", "company_phone", "monthly_income", "monthly_expenses", "comments", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)

    if @client.save