app/controllers/residentials_controller.rb

SELECT "residentials".* FROM "residentials"
---
  def index
    @residentials = Residential.all

INSERT INTO "residentials" ("name", "address", "cost", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Fracc Test"], ["address", "Address Fracc Test"], ["cost", "1233312.0"], ["user_id", 1], ["created_at", "2024-05-09 01:34:22.592437"], ["updated_at", "2024-05-09 01:34:22.592437"]]
---
  def create
    @residential = Residential.new(residential_params)

    if @residential.save

UPDATE "residentials" SET "address" = $1, "updated_at" = $2 WHERE "residentials"."id" = $3  [["address", "Address Fracc "], ["updated_at", "2024-05-09 01:34:31.958676"], ["id", 1]]
---
  def update
    if @residential.update(residential_params)

DELETE FROM "residentials" WHERE "residentials"."id" = ?  [["id", 3]]
---
  def destroy
    @residential.destroy

SELECT "residentials".* FROM "residentials" WHERE "residentials"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_residential
    @residential = Residential.find(params[:id])