app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", ""], ["password_digest", "[FILTERED]"], ["name", nil], ["last_name", nil], ["created_at", "2024-02-28 21:17:21.940805"], ["updated_at", "2024-02-28 21:17:21.940805"]]
---
  def create
    user = User.create!(user_params)